<?php
/*
 * [共通処理定数定義]
 */
#-------------------------------------
# 店舗カテゴリー
#-------------------------------------
$shopCategoryList = [
	'food' => 'お食事処',
	'souvenir' => 'おみやげ処',
	'other' => '他業種店'
];
#-------------------------------------
# 店舗営業時間
#-------------------------------------
#営業開始
$shopOpenHourList = [];
for ($i = 6; $i <= 20; $i++) {
	$shopOpenHourList[$i] = $i;
}
#営業終了
$shopCloseHourList = [];
for ($i = 11; $i <= 24; $i++) {
	$shopCloseHourList[$i] = $i;
}
#分：15分刻み
$shopMinuteList = [
	'00' => '00',
	'15' => '15',
	'30' => '30',
	'45' => '45'
];
#-------------------------------------
# 店舗営業日
#-------------------------------------
$shopCloseWeekList = [
	'0' => '日',
	'1' => '月',
	'2' => '火',
	'3' => '水',
	'4' => '木',
	'5' => '金',
	'6' => '土'
];
#-------------------------------------
# おすすめ商品登録数
#-------------------------------------
$recommendedItemMax = 3;

#-------------------------------------
# ページャー表示最大数
#-------------------------------------
$pagerDisplayMax = 10;

#-------------------------------------
# 表示件数選択リスト／初期値：10件
#-------------------------------------
$displayNumberList = [10, 20, 30, 50, 100];
$initialDisplayNumber = 10;
